# -*- coding: utf-8 -*-
# @Time : 2020/7/13 0:25
# @Author : MYH
# @File : A 极简计算机基础.py
# @Software: PyCharm

# 二进制是仅有0和1组成进位和运算逻辑 运算方式为逻辑运算
# 单个0或1表示一个bit/比特 8个bit为一个Byte/字节
# 基本电路有通断两种情况,对应就是0或者1
# 数据类型在计算机中都采用二进制进行表示 浮点数采用国际通用浮点数算数标准(IEEE754)表示 字符通过UTF-8或ASCII等编码形式进行编码
# 英文通常采用的是ASCII编码 中文使用GB2312-80进行编码
# 但是还是有很多字符,这时就需要在国际上被广泛采用的编码标准 Unicode 世界上绝大多数字符Unicode赋予它一个唯一的编码 用两个字节进行表示 能够节省存储空间
# 进制: 生活中有各种进制 常用的有二进制 八进制 十进制 十六进制

# 信息是特定的数据 人类通过信息技术产生大量数据,大部分数据高速动态产生,包括多种格式化形式,数据有其利用的价值
# 大量Volume 高速Velocity 多样Variety 价值Value 特点形成了一个对数据的新的描述和定义 这就是大数据

# ...